app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at", "author", "price", "published_date") VALUES ('To Kill A Mockingbird', '2026-01-27 23:00:49.331824', '2026-01-27 23:00:49.331824', 'Harper Lee', 9.0, '1976-05-15') RETURNING "id"

  def update
    @book = Book.find(params[:id])

    if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = 2 LIMIT 1
UPDATE "books" SET "title" = ?, "updated_at" = ?, "author" = ?, "price" = ? WHERE "books"."id" = ?  [["title", "Updated Title"], ["updated_at", "2026-01-26 21:51:33.005341"], ["author", "New Author"], ["price", 24.0], ["id", 1]]